app/controllers/repairs_controller.rb

  def index
    @repairs = Repair.all
---
SELECT * FROM "repairs"

  def show
    @repair = Repair.find(params[:id])
---
SELECT * FROM "repairs" WHERE ("repairs"."id" = 1)

  def edit
    @repair = Repair.find(params[:id])
---
SELECT * FROM "repairs" WHERE ("repairs"."id" = 2)

  def create
    @repair = Repair.new(params[:repair])

    respond_to do |format|
      if params[:use_date] == false || params[:use_date] == 0
        @repair.repair_date = nil
      end
      if @repair.save
---
INSERT INTO "repairs" ("title", "car", "repair_date", "notes", "created_at", "updated_at") VALUES('', '', '2010-03-09', '', '2010-03-09 02:13:17', '2010-03-09 02:13:17')

  def destroy
    @repair = Repair.find(params[:id])
    @repair.destroy
---
SELECT * FROM "repairs" WHERE ("repairs"."id" = 1)
DELETE FROM "repairs" WHERE "id" = 1